/**
 * Created by Anatoliy on 11.11.2016.
 *
 * Задание:
 1. Написать метод вычисления факториала.
 2. Написать метод вывода значения факториала в файл.
 3. Написать метод, в котором N потоков под индексами i = 1..N параллельно вычисляют факториал числа (K * i)
 и записывают в файл с названием "factorial K * i" (например, для K = 1000, "factorial 1000", "factorial 2000", ....)

 Дополнительно:
 4. Произвести бенчмарк и сравнить скорость работы многопоточного и аналогичного однопоточного кода.

 Протестировать программу для N = 100, K = 1000.

 */
package JavaOOP.Lesson11.HomeWork;